In [3]:
import numpy as np
import sys
sys.path
import pandas as pd

In [4]:
titanic_df = pd.read_csv("sample.csv")
titanic_df

   Survived  Pclass     Sex   Age     Fare Embarked
0         1       1    male  80.0  30.0000        S
1         1       2  female   4.0  39.0000        S
2         0       2  female  24.0  13.0000        S
3         0       2    male  37.0  26.0000        S
4         0       3  female  11.0  31.2750        S
5         1       3  female  13.0   7.2292        C
6         0       3    male  22.0   7.2500        S

In [9]:
titanic_df.shape

(7, 6)

In [16]:
titanic_df.shape[0]

7

In [17]:
titanic_df.shape[1]

6

In [19]:
titanic_df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Fare', 'Embarked'], dtype='object')

In [27]:
titanic_df["Age"]

0    80.0
1     4.0
2    24.0
3    37.0
4    11.0
5    13.0
6    22.0
Name: Age, dtype: float64

In [29]:
titanic_df[["Age"]]

    Age
0  80.0
1   4.0
2  24.0
3  37.0
4  11.0
5  13.0
6  22.0

In [31]:
titanic_df[["Age","Fare"]]

    Age     Fare
0  80.0  30.0000
1   4.0  39.0000
2  24.0  13.0000
3  37.0  26.0000
4  11.0  31.2750
5  13.0   7.2292
6  22.0   7.2500

In [33]:
valiables = ['Survived', 'Pclass', 'Sex', 'Age']
titanic_df = titanic_df[valiables]
titanic_df

   Survived  Pclass     Sex   Age
0         1       1    male  80.0
1         1       2  female   4.0
2         0       2  female  24.0
3         0       2    male  37.0
4         0       3  female  11.0
5         1       3  female  13.0
6         0       3    male  22.0

In [40]:
titanic_df.query("Age>20")

   Survived  Pclass     Sex   Age
0         1       1    male  80.0
2         0       2  female  24.0
3         0       2    male  37.0
6         0       3    male  22.0

In [46]:
titanic_df.query('(Sex == "female")')

   Survived  Pclass     Sex   Age
1         1       2  female   4.0
2         0       2  female  24.0
4         0       3  female  11.0
5         1       3  female  13.0

In [51]:
titanic_df.query(("Age>20"))

   Survived  Pclass     Sex   Age
0         1       1    male  80.0
2         0       2  female  24.0
3         0       2    male  37.0
6         0       3    male  22.0

In [54]:
tit=titanic_df['Age'] > 20
tit

0     True
1    False
2     True
3     True
4    False
5    False
6     True
Name: Age, dtype: bool

In [55]:
tit[tit]

0    True
2    True
3    True
6    True
Name: Age, dtype: bool